In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("used_cars_maruti.csv")
data.head()

,Location,Fuel_Type,Transmission,Owner_Type,Seats,Price,Age,Model,Mileage,Power,KM_Driven
0,Chennai,Diesel,Manual,First,7,6.00,8,ertiga,20.77,88.76,87
1,Jaipur,Diesel,Manual,First,5,5.60,5,swift,25.20,74.00,64
2,Jaipur,Diesel,Manual,First,5,5.99,3,swift,28.40,74.00,25
3,Hyderabad,Petrol,Manual,Second,5,2.75,7,alto,20.92,67.10,54
4,Jaipur,Petrol,Manual,Second,5,1.85,11,wagon,14.00,64.00,83

In [4]:
data.shape

(1070, 11)

In [6]:
data.describe()

,Seats,Price,Age,Mileage,Power,KM_Driven
count,1070.000000,1070.000000,1070.000000,1070.000000,1070.000000,1070.000000
mean,5.160748,4.524168,6.455140,21.586299,73.327636,52.863551
std,0.593346,2.226416,3.527434,3.386033,13.772010,29.957033
min,4.000000,0.450000,1.000000,11.300000,34.200000,0.000000
25%,5.000000,2.820000,4.000000,19.000000,67.040000,31.000000
50%,5.000000,4.250000,6.000000,21.400000,74.000000,50.500000
75%,5.000000,6.000000,8.000000,23.400000,85.800000,69.000000
max,8.000000,10.190000,22.000000,28.400000,100.000000,168.000000

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1070 entries, 0 to 1069
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Location      1070 non-null   object
 1   Fuel_Type     1070 non-null   object
 2   Transmission  1070 non-null   object
 3   Owner_Type    1070 non-null   object
 4   Seats         1070 non-null   int64
 5   Price         1070 non-null   float64
 6   Age           1070 non-null   int64
 7   Model         1070 non-null   object
 8   Mileage       1070 non-null   float64
 9   Power         1070 non-null   float64
 10  KM_Driven     1070 non-null   int64
dtypes: float64(3), int64(3), object(5)
memory usage: 92.1+ KB

In [9]:
data['Model'].unique()

array(['ertiga', 'swift', 'alto', 'wagon', 'vitara', 'zen', 'ritz',
       'omni', 'eeco', 'ciaz', 'baleno', 'a-star', 'celerio', '800',
       's-cross', 'esteem', 'ignis', 'dzire', 'sx4', 'versa'],
      dtype=object)

In [10]:
data['Model'].nunique()

20

In [11]:
data['Model'].value_counts(normalize=True)

Model
swift      0.304673
alto       0.125234
wagon      0.116822
ertiga     0.065421
ciaz       0.061682
ritz       0.059813
baleno     0.057009
celerio    0.052336
vitara     0.032710
zen        0.025234
dzire      0.022430
omni       0.018692
a-star     0.015888
eeco       0.011215
800        0.011215
sx4        0.008411
ignis      0.005607
s-cross    0.002804
esteem     0.001869
versa      0.000935
Name: proportion, dtype: float64

In [14]:
data['Owner_Type'].unique()

array(['First', 'Second', 'Third', 'Fourth & Above'], dtype=object)

In [17]:
data['Owner_Type'].value_counts(normalize=True)

Owner_Type
First             0.860748
Second            0.120561
Third             0.017757
Fourth & Above    0.000935
Name: proportion, dtype: float64

In [20]:
data['Age'].value_counts()

Age
4     169
5     138
6     134
3     120
8      90
7      87
2      65
9      61
10     56
11     33
12     28
13     20
14     18
1      17
16      9
17      7
15      7
18      6
22      2
20      2
21      1
Name: count, dtype: int64

In [22]:
data['Price'].max()

10.19

In [28]:
data.sort_values('Price', ascending=True)[0:9]

,Location,Fuel_Type,Transmission,Owner_Type,Seats,Price,Age,Model,Mileage,Power,KM_Driven
577,Jaipur,Petrol,Manual,Third,5,0.45,22,zen,17.3,60.0,95
297,Jaipur,Petrol,Manual,Second,4,0.45,16,800,16.1,37.0,12
594,Pune,Petrol,Manual,First,4,0.50,17,800,16.1,37.0,52
1012,Jaipur,Petrol,Manual,First,4,0.51,18,800,16.1,37.0,75
1022,Jaipur,Petrol,Manual,Third,5,0.53,22,zen,17.3,60.0,95
41,Mumbai,Petrol,Manual,Third,5,0.55,18,zen,17.3,60.0,60
1053,Pune,Petrol,Manual,First,4,0.55,20,800,16.1,37.0,78
712,Jaipur,Petrol,Manual,Second,4,0.63,18,800,16.1,37.0,53
61,Kolkata,Petrol,Manual,First,5,0.65,17,zen,17.3,60.0,65

In [36]:
Model_df = data.Model.value_counts().reset_index();

In [37]:
Model_df.columns = ["Model", "Counts"]

In [38]:
Model_df.head()

    Model  Counts
0   swift     326
1    alto     134
2   wagon     125
3  ertiga      70
4    ciaz      66

In [43]:
import matplotlib.pyplot as plt

plt.figure(figsize=(10, 5))
plt.bar(Model_df['Models'], model_df['Counts'], color="r", edgecolor="black")



plt.xlabel("Car Model")



plt.ylabel("Number of Sales")


plt.title("Top 10 Selling Car Models")



plt.show()

KeyError: 'Models'

In [42]:
top10_models=list(model_df.Models)[0:10]





top10_models



models_to_remove = list(model_df[model_df.Counts<10]['Models'])

NameError: name 'model_df' is not defined

### Find out the variations of sales price for only SWIFT model for different ages.(e.g. one year old, two year old and so on)